package th.ac.psu.phuket.coe.pujidao;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.ListView;
import android.widget.TextView;

public class C_Culture extends AppCompatActivity {
    ListView culList;
    int[] IMCUL={R.drawable.die,R.drawable.marry,R.drawable.marry1};
    String[] NameCulture ={"พิธีงานศพแบบจีนฮกเกี้ยน","พิธีแต่งงานแบบจีนฮกเกี้ยน","วัฒนธรรมเกี่ยวกับภาษาและการพูดจา"};
    String[] DecCulture ={"หีบศพแบบจีน หรือ โลงจีนทำด้วยไม้ซุงทั้งท่อน โดยขุดเป็นหลุมให้ใส่ศพได้ เรียกว่าโลงหัวหมู มีการแต่งตัวผู้ตายและใส่ทรัพย์สินประจำตัวผู้ตายลงไปในโลงศพด้วยการตั้งศพบำเพ็ญกุศลนิยมตั้งศพไว้ที่บ้าน ก" +
            "่อนนำไปฝังที่สุสานตามประเพณี ในการตั้งศพไว้ที่บ้าน บางคราวต้องปิดถนน เพื่อใช้เนื้อที่ของถนนวาง โต๊ะ เก้าอี้ กางเต้นท์ เพื่อรับรองแขกเหรื่อที่มาร่วมงานศพ ซึ่งส่วนใหญ่นิยมไปร่วมงานในตอนกลางคืน " +
            "พิธีกรรมมีทั้งพิธีสงฆ์นิกายหินยานและมหายาน หรือ พิธีสวดกงเต็ก การเลี้ยงแขกเหรื่อที่มาร่วมในงาน เป็นเรื่องใหญ่ที่เจ้าภาพถือว่า จะต้องไม่ให้ขาดตกบกพร่อง อาหารที่ใช้เลี้ยงในงานศพมีทั้งคาวหวานและเครื่องดื่ม " +
            "การเคลื่อนศพไปฝังนิยมใช้คนเป็นจำนวนมากช่วยกันหามโลงไปสุสาน โดยเฉพาะถ้าเป็นศพหรือญาติพี่น้องของเศรษฐีเหมืองแร่จะนำกุลีเหมืองมาช่วยหามโลงศพผลัดเปลี่ยนเป็นระยะ ๆ ก่อนถึงหลุมฝังศพ " +
            "นิยมนำไปฝังในสุสานของตระกูล สุสานกวางตุ้ง สุสานเขารัง ผู้ที่มาช่วยหามโลงศพจะได้รับ ของที่ระลึกถ้าเจ้าภาพมีฐานะจะเป็น อังเปา (เงินใส่ซองแดงเพื่อเป็นสิริมงคลแก่ผู้นำ ช่วยงาน) หรือผ้าขาวม้าสีแดง ผ้าขนหนูผืนเล็ก ๆ ผูกโบว์สีแดง เป็นต้น\n" +
            "\n" +
            "ก่อนเคลื่อนศพออกจากบ้าน จะต้องตั้งโต๊ะไหว้ศพ ของที่นำมาเซ่นไหว้ได้แก่ ไก่ หัวหมู หรือใช้หมูย่างทั้งตัว เส้นหมี่เหลือง เหล้าขาว ขนมครบชุด ผลไม้ ผัก โดยลูกหลานต้องออกมาทำความเคารพแบบจีน " +
            "และกล่าวคำเชิญผู้ตายให้รับของดังกล่าว พิธีนี้ต้องกระทำให้เสร็จสิ้นก่อนเที่ยง เพราะนิยมเคลื่อนศพออกจากบ้านเวลาเที่ยง นอกจากนี้ลูกหลานจะต้องไว้ทุกข์โดยการสวมเสื้อผ้าเนื้อดิบ ไม่โกนหนวด ไม่ตัดผม และไม่รีดเสื้อผ้า " +
            "เป็นเวลา 11 เดือน กับอีก 28-29 วัน จึงจะโกนหนวด ตัดผมได้ และเปลี่ยนเป็นสวมเสื้อผ้าสีเขียวเรียกว่า “ผลัดเขียว” เป็นเวลา 99 วัน จึงเปลี่ยนเป็นสวมเสื้อผ้าสีแดงและสีต่าง ๆ เรียกว่า “ผลัดแดง” เป็นอันสิ้นสุดการไว้ทุกข์" +
            " ปัจจุบันการไว้ทุกข์ไม่เคร่งครัด แล้วแต่ความเหมาะสมของแต่ละครอบครัว บางครอบครัวแต่งกายไว้ทุกข์ เป็นเวลา 3 เดือนบ้าง 1 เดือนบ้าง หรือบางครอบครัวออกทุกข์ทันทีหลังเสร็จสิ้นงานศพ",

             "การแต่งงานแบบจีนในภูเก็ต เพื่อเป็นการให้เกียรติแก่เจ้าสาวและครอบครัว ให้มีความมั่นใจในการครอบครองดูแลเจ้าสาวด้วยการทาบทาม สู่ขอ หมั้นหมาย “ผ่างเต๋” (การเชิญญาติผู้ใหญ่จิบน้ำชา) และ “เวียนสาดเวียนหมอน” " +
            "(พิธีส่งตัวบ่าวสาวเข้าห้องนอน) อึ่มหลาง(แม่ซื่อ) และ “แม่สาร” เป็นผู้ดำเนินการต่าง ๆ สมัยก่อนคู่สมรสมักไม่เคยเห็นหน้ากัน กว่าจะถึงวันแต่งงานกินเวลาเป็นเดือนเป็นปี ปัจจุบันได้มีความพยายามฟื้นฟูประเพณีนี้ขึ้น มีการประยุกต์พิธีการ\n" +
            "พิธีการวันแต่งงาน\n" +
            "เครือญาติเจ้าบ่าวจะจุดประทัดเคลื่อนขบวนขันหมากไปบ้านเจ้าสาวเพื่อเชิญเจ้าสาวไปจัดพิธีผ่างเต๋ ณ สถานที่อันควรตามที่ได้ตกลงไว้ มีกลุ่มดนตรีนำด้วยเสียง “ตีต่อตีเช้ง” จากฆ้องจีนและปี่จีนกลายเป็นสำนวนคำหมายถึงการแต่งงาน\n" +
            "ขันหมากประกอบด้วย ฮวดหนา(ตะกร้าจีนขนาดเล็ก)ใส่เงินทองของมีค่าแหวนหมั้น และเสี่ยหนา(ตะกร้าจีนขนาดใหญ่)บรรทุกรถหรือคาบ ภายในใส่อาหาร ขนม เครื่องดื่ม ชุดน้ำชา ธูปเทียน เครื่องหอมเซ่นไหว้ เมื่อถึงบ้านเจ้าสาว จึงมอบให้อึ่มหลางดำเนินการมอบให้ฝ่ายเจ้าสาว\n" +
            "เจ้าบ่าวนั่งหล่างเชี้ย(รถลากหรือรถเก๋ง) พัวเกี๋ย(เพื่อนเจ้าบ่าว) คอยช่วยทำหน้าที่ต่าง ๆ โดยเฉพาะการเป็นพิธีกรบอกขั้นตอน\n" +
            "เมื่อถึงบ้านเจ้าสาว จุดประทัดบอกฤกษ์อีกครั้ง ฝ่ายเจ้าสาวจะจัดเด็กรอรับเจ้าบ่าวเข้าบ้านประกอบพิธี พิธีกรจะประกาศชื่อญาติเชิญมารับน้ำชา บ่าวสาวจะใช้ผ้าเช็ดหน้ากวาดที่นั่งเป็นการเชิญญาตินั่ง แล้วช่วยประคองถาดน้ำชาส่งให้ญาติญาติจิบเสร็จก็ส่งคืนพร้อมให้อั่งเปา ญาติที่ประสงค์อวยพรก็กระทำในช่วงนี้ \n",

            "การพูดจาระหว่างเพื่อนฝูงที่สนิทรักใคร่ชอบพอกัน มักใช้คำหยาบทักทายกันโดยไม่สนใจว่าผู้ใดจะได้ยิน คนที่ไม่เข้าใจหรือคนต่างถิ่นอาจจะเข้าใจผิดว่าทะเลาะกัน การขานรับการเรียกของผู้ใหญ่ที่ใช้โดยทั่วไป คือ “โอย” “จ๋า” และคำที่ใช้แสดงการเห็นด้วยมักใช้คำว่า “เออ” หรือ “อือ” “จ๊ะ”" +
                    " ถ้าต้องการพูดแสดงถึงความสุภาพลดความกระด้างลงด้วยหางเสียงว่า “อ๊าว” “อื้อ” “น้า” “ต๊า” “อ่า” เป็นต้น ภูเก็ตไม่มีประเพณีคนรับใช้ที่จะต้องย่อตัวหรือคุกเข่าต่อหน้าเจ้านาย ทุกคนจะยืนหรือนั่งในที่เสมอกันหมด คนขับรถมีสิทธิ์ร่วมโต๊ะอาหารกับนายจ้างได้ ทำให้ข้าราชการที่ได้มีโอกาสมาบริหารจังหวัดภูเก็ตในระดับผู้ปกครอง มักจะมองว่าชาวภูเก็ตเป็นคนกระด้าง"};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_c__culture);

        culList = (ListView)findViewById(R.id.ListView6);
        CustomAdepter6 customAdepter6 = new CustomAdepter6();
        culList.setAdapter(customAdepter6);
    }
    class CustomAdepter6 extends BaseAdapter {


        @Override
        public int getCount() {
            return IMCUL.length;
        }

        @Override
        public Object getItem(int im) {
            return null;
        }

        @Override
        public long getItemId(int im) {
            return 0;
        }

        @Override
        public View getView(int im, View view6, ViewGroup viewGroup) {
            view6 = getLayoutInflater().inflate(R.layout.customlayout6,null);

            ImageView imageView6=(ImageView)view6.findViewById(R.id.imvCul);
            TextView textView_name6 = (TextView)view6.findViewById(R.id.txCul);
            TextView textView_decCul = (TextView)view6.findViewById(R.id.Detial_Cul);

            imageView6.setImageResource(IMCUL[im]);
            textView_name6.setText(NameCulture[im]);
            textView_decCul.setText(DecCulture[im]);
            return view6;
        }
    }
}
