package th.ac.psu.phuket.coe.pujidao;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.ListView;
import android.widget.TextView;

public class Festival extends AppCompatActivity {
    ListView fesList;
    int[] IMF={R.drawable.phuketvegetarian,R.drawable.potu,R.drawable.moonfes,R.drawable.chunjie,
               R.drawable.qingming,R.drawable.derntao};
    String[] NameFes={"ประเพณีถือศีลกินผัก","เทศกาลพ้อต่อ","เทศกาลไหว้พระจันทร์","วันตรุษจีน","เทศกาลเช็งเม้ง","ประเพณีเดินเต่า"};
    String[] DecFes={"ประเพณีถือศีลกินเจบ้านและชาวจีนที่อยู่ในจังหวัดภูเก็ตเรียกกันว่า “เจี๊ยะฉ่าย”เป็นความเชื่อลัทธิเต๋าซึ่งนับถือบูชาเซียนเทพเจ้า " +
            "วีรบุรุษเป็นประเพณีที่นับถือมาอย่างช้านาน โดยเฉพาะคนเชื้อสายจีนฮกเกี้ยนที่อาศัยเป็นจำนวนมากในจังหวัดภูเก็ต คำว่า “เจี๊ยะฉ่าย”แปลว่ากินผัก " +
            "มีวันประกอบพิธีตรงกับวันที่ 1 ค่ำเดือน 9 ค่ำตามปฏิทินนขีนของทุก ๆปีสำหรับประเพณีถือศีลกินเจจะจัดขึ้นเก้าวันซึ่งจุดมุ่งหมาย " +
            "ก็เพื่อเป็นการชำระบาปเคราะห์ถือศีลปฏิบัติธรรมให้สะอาดบริสุทธิ์ทั้งกายวาจาใจ ผู้ร่วมประเพณีจะต้องสวมใส่ชุดขาวและละเว้นการละเมิดศีลห้ารักษากายใจวาจาให้บริสุทธิ์" +
            "ตลอดระยะเวลา 9 วัน",
    "พ้อต่อ (ภาษาคนภูเก็ต) หรือ วันสารทจีน ของจังหวัดภูเก็ตเป็นเทศกาลงานบุญอุทิศส่วนกุศลไปให้บรรพบุรุษ เป็นประเพณีที่ชาวไทยเชื้อสายจีนในจังหวัดภูเก็ตปฏิบัติสืบทอดต่อกันมายาวนาน " +
            "คำว่า “พ้อต่อ” เป็นคำในภาษาจีน มีความหมายว่า การอนุเคราะห์ผู้อื่นให้พ้นจากความทุกข์ยาก ด้วยการประกอบพิธีบวงสรวง บำเพ็ญกุศล เพื่ออุทิศอานิสงส์ " +
            "อันเกิดจากการบำเพ็ญนั้นแก่บรรพบุรุษ ญาติพี่น้องผู้ล่วงลับ อันเป็นการแสดงถึงความกตัญญูกตเวทีของลูกหลานานพ้อต่อ สิ่งที่ขาดไม่ได้เลยสำหรับงานนี้นั่นก็คือ " +
            "ขนมเต่าสีแดง หรือที่เรียกว่า อั่งกู้ เรียกได้ว่าเป็นเอกลักษณ์ของเทศกาลนี้เลย",
    "วันไหว้พระจันทร์ เป็นเทศกาลตามวัฒนธรรมจีนที่มีขึ้นในกลางฤดูใบไม้ร่วง เพื่อเฉลิมฉลองการเก็บเกี่ยว จะมีขึ้นในคืนวันเพ็ญเดือน 8 ตามปฏิทินจันทรคติ และในเทศกาลไหว้พระจันทร์นี้ " +
            "ชาวจีนจะเฉลิมฉลองด้วยการไหว้ดวงจันทร์ในเวลากลางคืน ในบางประเทศ เช่น ฮ่องกง, ไต้หวัน, สิงคโปร์ หรือเวียดนาม จะจับเป็นประเพณีใหญ่ มีการเฉลิมฉลองด้วยโคมไฟสีแดง " +
            "เป็นสีสันยามค่ำคืน หรือบางแห่งอาจมีการเชิดมังกร ทั้งนี้จะมีชื่อเรียกต่างกันออกไปตามแต่ท้องถิ่นสิ่งที่ขาดไม่ได้เลยสำหรับงานนี้นั่นก็คือ ขนมไหว้พระจันทร์",

            "ตรุษจีน เป็นวันหยุดตามประเพณีที่สำคัญที่สุดของคนไทยเชื้อสายจีนยังมีอีกชื่อหนึ่งว่า \"เทศกาลฤดูใบไม้ผลิ\" เพราะฤดูใบไม้ผลิตามปฏิทินจีนเริ่มต้นด้วยวันลีชุน " +
                    "ซึ่งเป็นวันแรกในทางสุริยคติของปีปฏิทินจีน ันดังกล่าวยังเป็นวันสิ้นสุดฤดูหนาว ซึ่งคล้ายกันกับงานเทศกาลของตะวันตก เทศกาลนี้เริ่มต้นในวันที่ 1 เดือน 1" +
                    " ในปฏิทินจีนโบราณและสิ้นสุดลงในวันที่15ด้วยเทศกาลโคมไฟคืนก่อนตรุษจีนเป็นวันซึ่งครอบครัวจีนมารวมญาติเพื่อรับประทานอาหารเย็นเป็นประจำทุกปี  " +
                    "แต่คนไทยจะติดเป็นความเคยชินว่า วันสิ้นปีจะเป็นวันที่31แต่ของจีนจะไม่ใช่พอใกล้ๆจะสิ้นปี ชาวจีนจะนิยมทำความสะอาดบ้านครั้งใหญ่ เรียกว่า ล้างบ้าน" +
                    " พานหยากไย่กันแทบทุกซอกมุม ครั้งพอถึงช่วงเทศกาล จะมีการหยุดงาน หยุดกิจการค้า เพื่อทำพิธีไหว้เจ้าที่ ต้องไหว้ 2 วันซ้อน ซึ่งมีไหว้กลางดึกด้วย " +
                    "นอกจากนี้ก็จะได้ใช้เวลาในช่วงนี้ไปเยี่ยมคารวะผู้ใหญ่ญาติมิตรที่เคารพนับถือ และเที่ยวพักผ่อน จึงมีสำนวนของวันตรุษจีน ว่า “วันจ่าย วันไหว้ วันถือ” ",

                    "ชิงหมิง (清明节,) หรือ เช็งเม้ง, เชงเม้ง \"เช็ง\"หรือ\"เฉ่ง\" หมายถึง สะอาด บริสุทธิ์ และ \"เม้ง\"หรือ\"เบ๋ง\" หมายถึง สว่าง" +
                            " รวมแล้วหมายความถึง ช่วงเวลาแห่งความแจ่มใส รื่นรมย์เช็งเม้งในประเทศจีน เริ่มต้นประมาณ 4-5 เมษายน ไปจนถึง 19-20 เมษายน " +
                            "เป็นฤดูใบไม้ผลิ อากาศจะคลายความหนาวเย็น เริ่มเข้าสู่ความอบอุ่น มีฝนตกปรอย ๆ มีบรรยากาศสดชื่น ท้องฟ้าใสสว่าง (เป็นที่มาของชื่อ เช็งเม้ง)" +
                            "สำหรับในประเทศไทยเทศกาลเช็งเม้ง ถือวันที่ 5 เมษายนของทุกปีเป็นหลักแล้วนับวันก่อนถึง3วันและเลยไปอีก 3 วัน รวมเป็น 7 วัน (2 - 8 เมษายน) " +
                            "แต่ในปัจจุบันเนื่องจากมีปัญหาการจราจรคับคั่ง เลยขยายช่วงเวลาเทศกาลให้เร็วขึ้นอีก 3 สัปดาห์ (ประมาณ 15 มีนาคม - 8 เมษายน) แต่ในภาคใต้บางพื้นที่ " +
                            "เช่น จังหวัดตรังจะจัดเร็วกว่าที่อื่น1วันประมาณวันที่4เมษายนของทุกปีประเพณีที่สำคัญมากที่สุดของของชาวจีน คือ ไหว้บรรพบุรุษที่สุสาน ฮวงซุ้ย(แต้จิ๋ว) " +
                            "แต่คนฮกเกี้ยนเรียกว่า บ่องป้าย เป็นการแสดงความกตัญญูต่อบรรพบุรุษ",

                     "เป็นประเพณีดั้งเดิมของชาวภูเก็ต เดินเต่า คือการเดินหาไข่ที่ขึ้นมาวางไข่บนหาดทราย นิยมกันในบริเวณที่มีเต่าขึ้นมาวางไข่ คือ บริเวณริมหาดชายฝั่งทะเลอันดามัน" +
                             " ได้แก่ ทางตะวันตกของเกาะภูเก็ต ทางฝั่งทะเลตะวันตกของอำเภอท้ายเหมือง และอำเภอตะกั่วป่า จังหวัด ประเพณีเดินเต่ามีมานานแล้ว โดยสมัยดั้งเดิมนั้นชาวบ้านในละแวกใกล้เคียงกับชายหาดต่างๆ " +
                             "นิยมคดห่อ (ห่อข้าว) ไปกินกันที่ชายทะเลในตอนบ่ายๆ และจะอยู่กันจนรุ่งเช้า จุดไฟผิงกันหนาวแล้วก็ถือโอกาสเดินหาไข่เต่า ซึ่งเป็นสิ่งที่หายาก และเป็นอาหารที่โอชะ การเดินเต่านั้นเดินกันได้เฉพาะฤดูเต่าวางไข่เท่านั้น " +
                             "คือ ประมาณเดือน 11 แรม 1 ค่ำ รายปลายเดือนตุลาคม หรือต้นเดือนพฤศจิกายน ไปจนถึงเดือน 11 แรม 1 ค่ำ ราวปลายเดือนตุลาคม หรือต้นเดือนพฤศจิกายน ไปจนถึงเดือน 4 หรือต้นเดือนกุมภาพันธ์ " +
                             "การเดินเต่าในสมัยดั้งเดิม สามารถเก็บไข่เต่ากันได้ทุกคน แต่สมัยหลังๆ รัฐบาลเก็บภาษี โดยให้มีสัมปทานเป็นหาดๆไป"};
    @Override

    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_festival);

        fesList = (ListView)findViewById(R.id.ListView5);
        CustomAdapter5 customAdapter5 = new CustomAdapter5();
        fesList.setAdapter(customAdapter5);
    }
    class CustomAdapter5 extends BaseAdapter{


        @Override
        public int getCount() {
            return IMF.length;
        }

        @Override
        public Object getItem(int ii) {
            return null;
        }

        @Override
        public long getItemId(int ii) {
            return 0;
        }

        @Override
        public View getView(int ii, View view5, ViewGroup parent) {
            view5 = getLayoutInflater().inflate(R.layout.customlayout5,null);

            ImageView imageView5=(ImageView)view5.findViewById(R.id.imvFes);
            TextView textView_name5 = (TextView)view5.findViewById(R.id.txtNf);
            TextView textView_decfes = (TextView)view5.findViewById(R.id.txtDecF);

            imageView5.setImageResource(IMF[ii]);
            textView_name5.setText(NameFes[ii]);
            textView_decfes.setText(DecFes[ii]);
            return view5;
        }
    }
}
