package th.ac.psu.phuket.coe.pujidao;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.ListView;
import android.widget.TextView;

public class Page_History extends AppCompatActivity {
   ListView hisList;
   int [] hisImage = {R.drawable.phuketold,R.drawable.tawteaw};
   String[] NameHistory ={"ประวัติเมืองภูเก็ต","ประวัติเมืองถลาง"};
   String[] DecHistory = {"เมืองภูเก็ตเป็นชื่อที่ทุกคนเพิ่งรู้จัก ในสมัยกรุงธนบุรีเจ้าเมืองภูเก็ตคนแรก คือ เมืองภูเก็จ (เทียน) เพราะก่อนหน้านี้นั้น เมืองภูเก็ตรู้จักในนามเมืองถลาง ซ" +
           "ึ่งเป็นเมืองที่อุดมไปด้วยแร่ดีบุก เกาะภูเก็ตในสมัยกรุงธนบุรีในระยะแรกนั้น คงจะเป็นชุมชนขนาดเล็กอยู่กันเป็นกลุ่ม ๆ ทำมาหากินด้วยการค้าแร่ดีบุก ทำนา ทำไร่ ขึ้นอยู่กับเมืองถลาง ต่อมา เมืองภูเก็จ (เทียน) " +
           "ได้รับการเลื่อนยศเป็น พระยาทุกรราช(เทียน) เจ้าเมืองภูเก็ต และมีความหวังที่จะเป็นเจ้าเมืองถลางให้จงได้ ครั้นในปี พ.ศ.2332 พระยาทุกรราช (เทียน) ได้เป็นพระยาถลาง ทำให้ตำแหน่งเจ้าเมืองภูเก็ตว่างลง " +
           "หลักฐานเจ้าเมืองภูเก็ตในช่วงนี้ไม่ชัดเจน พงศาวดารเมืองถลางกล่าวเพียงว่า หลวงภูเก็จข้างคต เป็นเจ้าเมือง แล้วได้ นายศรีชาย นายเวร เป็นพระภูเก็ต และเมื่อสิ้นสมัยนี้ เมืองภูเก็ตก็ถูกทำลายลงพร้อมกับเมืองถลาง " +
           "และมาเจริญอีกครั้งหนึ่งเมืองพระยาถลาง(เจิม)ได้เป็นเจ้าเมือง ก็พยายามจะฟื้นฟูเมืองถลางขึ้นมาใหม่ ด้วยเล็กเห็นผลประโยชน์มหาศาลคือ แร่ดีบุกที่เมืองภูเก็ต จึงสนับสนุนให้ลูกชายชื่อ แก้ว ได้เป็นเจ้าเมืองภูเก็ต" +
           "และต่อมาได้รับบรรดาศักดิ์เป็น พระภูเก็ตโลหะเกษตรารักษ์(แก้ว) ตั้งที่ทำการอยู่ที่กะทู้(บริเวณบ้านเก็ตโฮ่ ในปัจจุบัน) ทำกิจการขุดแร่ดีบุกจนสร้างความร่ำรวยอย่างมหาศาล บริเวณนี้มีลำคลองไหลผ่าน คือคลองบางใหญ่ " +
           "ลำคลองสายนี้ในอดีตเรือกำปั่นสามารถแล่นเข้า-ออกรับส่งสินค้าดีบุกได้อย่างสะดวก พระภูเก็ตโลหะเกษตรารักษ์ (แก้ว) มีบุตรชายชื่อ ทัต รับราชการฝ่ายมหาดไทย มีบรรดาศักดิ์เป็น หลวงพิทักษ์ทวีป ตั้งแต่สมัยรัชกาลที่ 3 " +
           "ได้เป็นพระภูเก็ตโลหะเกษตรารักษ์(ทัต) ในสมัยรัชกาลที่ 4 และได้เป็นพระยาวิชิตสงคราม(ทัต)ในสมัยรัชกาลที่ 5 กิจการเหมืองแร่ดีบุกได้ขยายพื้นที่ทำเหมืองแร่ดีบุกมาตามลำน้ำคลองบางใหญ่ ผ่านหมู่บ้านสามกองเข้าสู่บ้านทุ่งคา " +
           "และย้ายที่ทำการเมืองภูเก็ตมาที่ทุ่งคา ความเจริญได้ย้ายมาสู่บ้านทุ่งคาตั้งแต่บัดนั้นสืบมา",

           "พื้นที่เดิมของเกาะถลาง หรือ เกาะภูเก็ต ในแผนที่ของคลอดิอุส ปโตเลมี ประมาณ พ.ศ. 700 ระบุไว้ในชื่อ JUNK CEYLON เมื่อครั้งที่หลวงจีนอี้จิงเดินทางผ่านไปสืบพระพุทธศาสนาเรียกบริเวณนี้เป็น SILAN เปลี่ยนเสียงเป็น" +
                   " สลาง ในสมัยสุโขทัย มีปรากฏในจดหมายเหตุไทย - ฝรั่งเศส เป็น Jun Salon ฝ่ายเอกสารไทยใช้ ฉลาง มาจนถึงรัชกาลที่ 3 จึงมีปรากฏคำ ถลาง แทนชื่ออื่นทั้งหมด " +
                   "ในหัวเมืองฝั่งทะเลตะวันตกของภาคใต้มีศูนย์กลางปกครองที่เมืองถลาง เจ้าเมืองถลางจะได้รับโปรดเกล้าฯเป็นผู้สำเร็จราชการแปดหัวเมือง (เมืองกระ เมืองคุระ เมืองคุรอด เมืองตะกั่วป่า เมืองตะกั่วทุ่ง (บางคลี) " +
                   "เมืองกราภูงา เมืองภูเก็จ และเมืองถลาง) ศูนย์กลางการปกครองเมืองถลางในสมัยสมเด็จพระเจ้าอยู่หัวบรมโกศ อยู่ที่บ้านลิพอน (ตำบลศรีสุนทร)มีพญาถลางคางเสงเป็นเจ้าเมือง ย้ายไปอยู่ที่บ้านดอน (ตำบลเทพกระษัตรี)" +
                   "มีพญาถลางจอมเฒ่าบ้านดอนเป็นเจ้าเมือง และเกาะบ้านเคียน (ตำบลเทพกระษัตรี) ในสมัยกรุงธนบุรี มีพญาถลางจอมรั้งบ้านเคียน พญาถลางอาด พญาถลางชู พญาสุรินทราชาพิมลอัยาขัน เป็นเจ้าเมือง พ.ศ. ๒๓๒๙ " +
                   "มีพญาเพชรคีรีศรีพิชัยสงครามรามคำแหง(เทียน ประทีป ณ ถลาง) เป็นเจ้าเมือง ถัดไปเป็นพระยาถลางฤกษ์ (จันทโรจวงศ์) พญาถลางทับ พญาถลางคิน และพญาถลางชู(เจ้าเมืองถลางคนสุดท้าย) " +
                   "อำเภอถลางในอดีตเป็นเมืองของสองวีรสตรีท้าวเทพกระษัตรี และ ท้าวศรีสุนทร เดิมเรียกว่า อำเภอเมืองถลาง มีเจ้าเมืองปกครองเรียกว่า พระยาถลาง ได้จัดตั้งเป็นอำเภอ เมื่อปี พ.ศ. 2441"};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_page__history);

        hisList = (ListView)findViewById(R.id.ListView7);
        CustomAdepter7 customAdepter7 = new CustomAdepter7();
        hisList.setAdapter(customAdepter7);
    }
    class CustomAdepter7 extends BaseAdapter {
        @Override
        public int getCount() {
            return hisImage.length;
        }

        @Override
        public Object getItem(int img) {
            return null;
        }

        @Override
        public long getItemId(int img) {
            return 0;
        }

        @Override
        public View getView(int img, View view7, ViewGroup viewGroup) {
            view7 = getLayoutInflater().inflate(R.layout.customlayout7,null);

            ImageView imageView7=(ImageView)view7.findViewById(R.id.imHis);
            TextView textView_name7 = (TextView)view7.findViewById(R.id.nameHis);
            TextView textView_decHis = (TextView)view7.findViewById(R.id.detailHis);

            imageView7.setImageResource(hisImage[img]);
            textView_name7.setText(NameHistory[img]);
            textView_decHis.setText(DecHistory[img]);
            return view7;
        }
    }
}
