package th.ac.psu.phuket.coe.pujidao;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.ListView;
import android.widget.TextView;

public class PagePeople extends AppCompatActivity {
    ListView listPeople;
    int[] IMPeo={R.drawable.luangpu,R.drawable.tawtewkasadtree,R.drawable.cosimbie};
    String[] NamePeople ={"หลวงพ่อแช่ม วัดฉลอง","ท้าวเทพกระษัตรีและท้าวศรีสุนทร","พระยารัษฎานุประดิษฐ์มหิศรภักดี(คอซิมบี้ ณ ระนอง)"};
    String[] DecPeople ={"พระครูวิสุทธิวงศาจารย์ญาณมุนี(หลวงพ่อแช่ม วัดฉลอง)เป็นชาวบ้านบ่อแสน อ.ทับปุด จ.พังงาเป็นลูกศิษย์พระในวัดฉลองมาตั้งแต่เด็กได้บวชเป็นสามเณร " +
            "เล่าเรียนธรรมะอยู่ที่วัดฉลองจนอายุครบบวชเป็นพระภิกษุ ศึกษาด้านวิปัสสนาธุระจนเชี่ยวชาญ และต่อมาได้เป็นเจ้าอาวาสวัดฉลองหลวงพ่อแช่มมีส่วนเกี่ยวข้องกับประวัติศาสตร์เมืองภูเก็ต ด" +
            "้วยเรื่องอั้งยี่จีน พ.ศ. 2419 ที่ได้รวมตัวกันก่อการไม่สงบ ทำลายชีวิตและทรัพย์สินของชาวภูเก็ต หลวงพ่อแช่มได้เป็นขวัญและกำลังใจให้ชาวภูเก็ตที่ยึดมั่นศรัทธาต่อท่าน " +
            "สามารถขับไล่อั้งยี่ออกไปได้สำเร็จ ทำให้เกียรติคุณของหลวงพ่อแช่มเป็นที่ยอมรับในด้านความศักดิ์สิทธิ์ของขลัง นอกจากนี้ยังมีความรู้พิเศษในการรักษาผู้ป่วยเกี่ยวกับกระดูก " +
            "ความรู้ในการรักษากระดูกนี้ได้ถ่ายทอดมายังลูกศิษย์ และเจ้าอาวาสวัดฉลองต่อๆ มาได้สืบทอดการรักษามาจนถึงปัจจุบันนี้",

            "ท้าวเทพกระษัตรีมีชื่อเดิมว่าจันส่วนาท้าวศรีสุนทรเดิมชื่อ ุก เป็นน้องสาวของจัน จันและมุกเป็นบุตรีของนายทองคำจ้าเมืองถลางกับนางศรีทองมีพี่น้องทั้งหมด 5 คน " +
                    " จันเป็นลูกสาวคนโต  ส่วนมุกเป็นลูกคนที่สอง  จันได้แต่งงานกับนายภักดีภูธร  จันจึงมีบรรดาศักดิ์เป็นคุณหญิง ราเรียกว่า  คุณหญิงจัน\n" + " " +
                    "ในสมัยรัชกาลที่ 1 พระยาถลาง  สามีของคุณหญิงจันถึงแก่กรรม  เมืองถลางจึงขาดประมุขใน พ.ศ. 2328  พระเจ้าปดุงกษัตริย์พม่าได้ยกกองทัพครั้งใหญ่ที่เรียกว่า " +
                    " สงครามเก้าทัพ  ซึ่งทุ่มเทกองทัพเข้าตีประเทศไทยถึง 5 ทาง  โดยยกกองทัพเรือส่วนหนึ่งประมาณ 3,000 คนเข้ามาทางภาคใต้  ตีเมืองตะกั่วทุ่ง " +
                    " และตะกั่วป่าแตก  แล้วจึงยกทัพไปตีเมืองถลางเมื่อทัพพม่ายกไปถึงเมืองถลาง  ได้ยกพลขึ้นบก  แล้วตั้งค่ายล้อมเมืองไว้  คุณหญิงจันจึงต้องบัญชาการรบเอง " +
                    " โดยคุณมุกน้องสาวเป็นผู้ช่วยได้สั่งให้ตั้งค่ายป้องกันพม่าขึ้นหลายค่ายโดยให้น้องเขยเป็นแม่ทัพคุมไว้ค่ายหนึ่ง  และนายทองพูนน้องชายคุมไว้อีกค่ายหนึ่ง " +
                    " คุณหญิงจันกับคุณมุกได้รวบรวมผู้หยิงหลายร้อยคนให้แต่งตัวเป็นชาย  ส่วนคุณหญิงจันและคุณมุกแต่งตัวเป็นแม่ทัพและรองแม่ทัพ  สั่งให้ทหารยิงปืนใหญ่เข้าค่ายพม่า " +
                    " แล้วให้ทหารไทยโห่ร้องเพื่อข่มขวัญฝ่ายพม่าสร้างกลยุทธ์โดยเอาทางมะพร้าวมารมควันให้ดำแล้วนำมาทำเป็นปืน  เมื่อมองไกล ๆ จะคล้ายอาวุธจริง " +
                    "จากนั้นเคลื่อนย้ายทหารเข้าในเวลากลางวันและถอนทหารออกจากค่ายในเวลากลางคืน เพื่อลวงฝ่ายพม่าว่ามีทหารจำนวนมาก  ในที่สุดฝ่ายพม่าหลงกลไม่กล้าเข้าตีเมือง  " +
                    "จนขาดเสบียงอาหารและต้องถอยทัพกลับไปด้วยกลอุบายดังกล่าว ทำให้คุณหญิงจันและคุณมุกสามารถรักษาเมืองถลางไว้ได้\n",

            "มหาอำมาตย์โทพระยารัษฎานุประดิษฐ์มหิศรภักดี (คอซิมบี้ ณ ระนอง) เกิดที่จังหวัดระนอง เมื่อวันพุธ เดือนเมษายน พ.ศ.2400 เป็นบุตรชายคนเล็กของพระยาดำรงสุจริตมหิศรภักดี " +
                    "(คอซุเจียง ณ ระนอง) มารดาชื่อ คุณหญิงกิ้ม ชื่อเดิมของพระยารัษฎาฯ ชื่อว่า ซิมบี้ แปลว่า ผู้มีจิตใจงาม มีความขยันหมั่นเพียร บิดามารดาส่งเสริมให้บุตรคนนี้มีอาชีพค้าขาย" +
                    " เพื่อไปดูแลผลประโยชน์ของตระกูลที่บริษัทโกหงวน เมืองปีนัง เมื่ออายุได้ 25 ปี บิดาได้ส่งไปอยู่ที่เมืองเอ้หมึง มณฑลฮกเกี้ยน ประเทศจีน อยู่ได้ 2-3 ปี บิดาถึงแก่กรรม" +
                    " จึงกลับมาเมืองไทยในปี พ.ศ.2425 และเริ่มรับราชการ ต่อมาได้เป็นผู้ช่วยผู้ว่าราชการเมืองระนอง มีบรรดาศักดิ์เป็น พระยารัษฎานุประดิษฐ์มหิศรภักดี พ.ศ.2444" +
                    " ได้เป็นสมุหเทศาภิบาลมณฑลภูเก็ต และในขณะเดียวกัน รัชกาลที่ 6 ทรงพระกรุณาโปรดเกล้าฯ ให้ดำรงตำแหน่งองคมนตรีอีกตำแหน่งหนึ่งด้วย"};
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_page_people);

        listPeople = (ListView)findViewById(R.id.ListPeople);
        CustomAdepter8 customAdepter8 = new CustomAdepter8();
        listPeople.setAdapter(customAdepter8);


    }
    class CustomAdepter8 extends BaseAdapter {


        @Override
        public int getCount() {
            return IMPeo.length;
        }

        @Override
        public Object getItem(int im) {
            return null;
        }

        @Override
        public long getItemId(int im) {
            return 0;
        }

        @Override
        public View getView(int im3, View view7, ViewGroup viewGroup) {
            view7 = getLayoutInflater().inflate(R.layout.customlayout8,null);

            ImageView imageView6=(ImageView)view7.findViewById(R.id.ListPeople);
            TextView textView_name6 = (TextView)view7.findViewById(R.id.tnPeople);
            TextView textView_decCul = (TextView)view7.findViewById(R.id.tdecPeo);

            imageView6.setImageResource(IMPeo[im3]);
            textView_name6.setText(NamePeople[im3]);
            textView_decCul.setText(DecPeople[im3]);
            return view7;
        }
    }
}
